eight_hexagram = {
        (1, 1, 1): {"name": "乾", "symbol": "☰", "nature": "天"},
        (0, 0, 0): {"name": "坤", "symbol": "☷", "nature": "地"},
        (1, 0, 0): {"name": "震", "symbol": "☳", "nature": "雷"},
        (0, 0, 1): {"name": "艮", "symbol": "☶", "nature": "山"},
        (0, 1, 0): {"name": "坎", "symbol": "☵", "nature": "水"},
        (1, 0, 1): {"name": "离", "symbol": "☲", "nature": "火"},
        (1, 1, 0): {"name": "巽", "symbol": "☴", "nature": "风"},
        (0, 1, 1): {"name": "兑", "symbol": "☱", "nature": "泽"}
}
sixty_four_hexagrams_index = {
    ("乾", "乾"): "乾为天", ("坤", "坤"): "坤为地", ("震", "震"): "震为雷", ("巽", "巽"): "巽为风",
    ("坎", "坎"): "坎为水", ("离", "离"): "离为火", ("艮", "艮"): "艮为山", ("兑", "兑"): "兑为泽",
    ("坤", "乾"): "地天泰", ("乾", "坤"): "天地否", ("震", "乾"): "雷天大壮", ("乾", "震"): "天雷无妄",
    ("坎", "乾"): "水天需",   ("乾", "坎"): "天水讼",   ("艮", "乾"): "山天大畜", ("乾", "艮"): "天山遁",
    ("兑", "乾"): "泽天夬",   ("乾", "兑"): "天泽履",   ("巽", "乾"): "风天小畜", ("乾", "巽"): "天风姤",
    ("坤", "震"): "地雷复",   ("震", "坤"): "雷地豫",   ("坤", "坎"): "地水师",   ("坎", "坤"): "水地比",
    ("坤", "艮"): "地山谦",   ("艮", "坤"): "山地剥",   ("坤", "兑"): "地泽临",   ("兑", "坤"): "泽地萃",
    ("坤", "巽"): "地风升",   ("巽", "坤"): "风地观",   ("震", "坎"): "雷水解",   ("坎", "震"): "水雷屯",
    ("离", "坎"): "火水未济", ("坎", "离"): "水火既济", ("艮", "离"): "山火贲",   ("离", "艮"): "火山旅",
    ("震", "离"): "雷火丰",   ("离", "震"): "火雷噬嗑", ("兑", "离"): "泽火革",   ("离", "兑"): "火泽睽",
    ("巽", "离"): "风火家人", ("离", "巽"): "火风鼎",   ("震", "艮"): "雷山小过", ("艮", "震"): "山雷颐",
    ("震", "兑"): "雷泽归妹", ("兑", "震"): "泽雷随",   ("震", "巽"): "雷风恒",   ("巽", "震"): "风雷益",
    ("坎", "艮"): "水山蹇",   ("艮", "坎"): "山水蒙",   ("坎", "兑"): "水泽节",   ("兑", "坎"): "泽水困",
    ("坎", "巽"): "水风井",   ("巽", "坎"): "风水涣",   ("艮", "兑"): "山泽损",   ("兑", "艮"): "泽山咸",
    ("艮", "巽"): "山风蛊",   ("巽", "艮"): "风山渐",   ("兑", "巽"): "泽风大过", ("巽", "兑"): "风泽中孚",
    ("乾", "离"): "天火同人", ("离", "乾"): "火天大有", ("坤", "离"): "地火明夷", ("离", "坤"): "火地晋",
}